{
  "ErrorBlockedAccount": "Não foi possível realizar o login. Sua conta será temporariamente bloqueada devido à excessivas tentativas.",
  "ErrorCpfInvalid": "O CPF informado não é válido.",
  "ErrorCreateEmployee": "Ocorreu um erro ao criar o funcionário.",
  "ErrorDifferentPasswords": "As senhas informadas não são iguais.",
  "ErrorEmailAlreadyExits": "O E-mail informado já está cadastrado.",
  "ErrorEmailInvalid": "O E-mail informado não é válido.",
  "ErrorEmailNotFound": "O e-mail informado não pertence a um usuário registrado.",
  "ErrorEmailRequired": "O E-mail é obrigatório.",
  "ErrorEnvDefaultAvatarURL": "Ocorreu um erro ao recuperar a imagem de perfil do usuário. Por favor, entre em contato com um administrador.",
  "ErrorEnvJwtSecretKey": "Ocorreu um erro ao recuperar informações para realizar o login. Por favor, entre em contato com um administrador.",
  "ErrorEnvMaxLoginAttempts": "Ocorreu um erro ao recuperar informações para realizar o login. Por favor, entre em contato com um administrador.",
  "ErrorEnvNameGroup": "Ocorreu um erro ao recuperar o grupo do usuário. Por favor, entre em contato com um administrador.",
  "ErrorEnvPageSizeDefault": "Ocorreu um erro ao recuperar as informações para realizar a busca paginada. Por favor, entre em contato com um administrador.",
  "ErrorEnvPasswdHashSalt": "Ocorreu um erro ao criptografar a senha.",
  "ErrorForgotPasswd": "Não foi possível realizar a recuperação de senha.",
  "ErrorGenerateForgottenPasswdToken": "Ocorreu um erro ao gerar a autenticação da recuperação de senha. Por favor, entre em contato com um administrador.",
  "ErrorGeneratePassword": "Ocorreu um erro ao gerar a senha do usuário. Por favor, entre em contato com um administrador.",
  "ErrorGenericToken": "Não foi possível validar a autenticidade do usuário.",
  "ErrorInternal": "Ocorreu um erro interno no servidor.",
  "ErrorInvalidIdentifier": "A identificação do usuário é inválida.",
  "ErrorInvalidResetPasswdToken": "Não foi possível realizar a operação pois a credencial de acesso é inválida.",
  "ErrorLogin": "Ocorreu um erro ao realizar o login.",
  "ErrorLoginBlockedAccount": "Sua conta foi temporariamente bloqueada devido à excessivas tentativas de login.",
  "ErrorLoginCredentials": "E-mail e/ou senha incorretos.",
  "ErrorNoRequestResetPasswd": "Não foi possível realizar a operação pois o usuário não possui uma requisição para recuperar a senha.",
  "ErrorQueryTypecasting": "Não foi possível realizar a operação com as informações opcionais informadas.",
  "ErrorReadUsers": "Ocorreu um erro ao recuperar os usuários.",
  "ErrorResetPasswdExpires": "Não foi possível realizar a operação pois excedeu o tempo limite. Por favor, realize um novo pedido de recuperação.",
  "ErrorUpdateAnotherUserProfile": "Não é possível atualizar o perfil de outro usuário.",
  "ErrorUpdateUserProfile": "Ocorreu um erro ao atualizar as informações do perfil do usuário.",
  "ErrorUploadFileFileTooLarge": "O arquivo informado deve ser menor.",
  "ErrorUploadFileUnsupportedMimetype": "O arquivo informado está em um formato não suportado.",
  "ErrorUserGroupNotFound": "Ocorreu um erro ao definir o grupo do usuário. Por favor, entre em contato com um administrador.",
  "ErrorUserNotFound": "Não foi possível encontrar o usuário informado.",
  "SuccessForgotPasswd": "Operação realizada com sucesso. Um e-mail foi enviado com as próximas instruções.",
  "SuccessGeneric": "A operação foi realizada com sucesso.",
  "SuccessResetPasswd": "Senha recuperada com sucesso."
}